#+TITLE: TEST API

* Initial

#+NAME: Initial testing
#+BEGIN_SRC http :pretty
    POST http://localhost:8080/auth/sign-up
    Content-Type: application/json

    {
      "email": "david.wiktorsson@gmail.com",
      "password":"theday",
      "firstname":"David",
      "lastname":"Viktorsson"
    }
#+END_SRC

#+RESULTS: Initial testing
: {
:   "message": "Email already exists.",
:   "status": "error"
: }
